a1,a2,a3,a4=map(int,input("введите координаты точек a1,a2,a3,a4: ").split())
a=[0]*3
for i in range(3):
    a[i]=0
n=int(input("введите кол-во вводимых точек: "))
k=1
while True:
    p=int(input("введите координату точки ",k,": "))
    if (p>=a1) and (p<=a2):
        a[1]=a[1]+1
    if (p>a2) and (p<=a3):
      a[2]=a[2] + 1
    if (p>a3) and (p<=a4):
      a[3]=a[3] + 1
    k= k+ 1
    if k>n: break
print("кол-во точек в отрезке [",a1,", ",a2,"]: ",a[1])
print("кол-во точек в отрезке [",a2,", ",a3,"]: ",a[2])
print("кол-во точек в отрезке [",a3,", ",a4,"]: ",a[3])
